In [1]:
import pandas as pd

data = [10, 20, 30, 40]
s = pd.Series(data, index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [3]:
column = df['Age']
print(column)

0    24
1    27
2    22
3    32
Name: Age, dtype: int64

In [4]:
row = df.loc[1]  # Selects the second row (index 1)
print(row)

Name            Bob
Age              27
City    Los Angeles
Name: 1, dtype: object

In [5]:
subset = df.loc[1:3, ['Name', 'City']]  # Select rows 1 to 3 and columns 'Name' and 'City'
print(subset)

      Name         City
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

In [6]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [7]:
df.fillna(0, inplace=True)
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [8]:
df.dropna(inplace=True)

In [10]:
grouped = df.groupby('City').agg({'Age': ['mean']})
print(grouped)

             Age
            mean
City
Chicago       22
Houston       32
Los Angeles   27
New York      24

In [11]:
grouped = df.groupby('City').agg({'Age': ['mean', 'min', 'max']})
print(grouped)

             Age
            mean min max
City
Chicago       22  22  22
Houston       32  32  32
Los Angeles   27  27  27
New York      24  24  24